src/Reports/ПриходПоИзготовителям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ПриходПоИзготовителям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРубли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоллары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕвро</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиВДокументе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Reports/ПриходПоИзготовителям/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки текста запроса построителя отчета
//
Процедура УстановитьТекстЗапроса(ЕстьПолеРегистратор = Истина)

	// Описание исходного текста запроса.
	ТекстЗапроса =
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ИсточникДанных.Номенклатура.Изготовитель КАК Изготовитель,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Номенклатура.Изготовитель) КАК ИзготовительПредставление,
	 |	ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец КАК Поставщик,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец) КАК ПоставщикПредставление,
	 |	ИсточникДанных.Номенклатура КАК Номенклатура,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Номенклатура) КАК НоменклатураПредставление,
	 |	ИсточникДанных.Склад КАК Склад,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Склад) КАК СкладПредставление,
	 |	ИсточникДанных.Качество КАК Качество,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Качество) КАК КачествоПредставление,
	 |	ИсточникДанных.СтатусПартии КАК СтатусПартии,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтатусПартии) КАК СтатусПартииПредставление,
	 |	ИсточникДанных.СтрокаПрихода КАК СтрокаПрихода,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтрокаПрихода) КАК СтрокаПриходаПредставление,
	 |	ИсточникДанных.Организация КАК Организация,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Организация) КАК ОрганизацияПредставление,
	 |	ИсточникДанных.КоличествоПриход КАК Количество,
	 |	ИсточникДанных.СуммаРублиПриход КАК Сумма,
	 |	ИсточникДанных.Регистратор КАК Регистратор,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Регистратор) КАК РегистраторПредставление,
	 |	ИсточникДанных.Период КАК Период,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ) КАК ПериодДень,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА) КАК ПериодДекада,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ) КАК ПериодМесяц,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ) КАК ПериодКвартал,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД) КАК ПериодГод
	 |{ВЫБРАТЬ
	 |	ИсточникДанных.Номенклатура.Изготовитель.* КАК Изготовитель,
	 |	ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец.* КАК Поставщик,
	 |	Номенклатура.*,
	 |	Склад.*,
	 |	Качество.*,
	 |	СтатусПартии.*,
	 |	СтрокаПрихода.*,
	 |	Организация.*,
	 |	ИсточникДанных.КоличествоПриход КАК Количество,
	 |	ИсточникДанных.СуммаРублиПриход КАК Сумма,
	 |	Регистратор.* КАК Регистратор,
	 |	Период КАК Период,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}
	 |ИЗ
	 |	РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Номенклатура.Изготовитель).* КАК Изготовитель, (СтрокаПрихода.ТорговаяТочка.Владелец).* КАК Поставщик, (Номенклатура).* КАК Номенклатура, (Склад).* КАК Склад, (Качество).* КАК Качество, (СтатусПартии).* КАК СтатусПартии, (СтрокаПрихода).* КАК СтрокаПрихода, (Организация).* КАК Организация}) КАК ИсточникДанных
	 |{ГДЕ
	 |	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	 |	ИсточникДанных.СуммаРублиПриход КАК СуммаРублиПриход,
	 |	ИсточникДанных.Регистратор.* КАК Регистратор,
	 |	ИсточникДанных.Период КАК Период,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ)) КАК ПериодДень,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА)) КАК ПериодДекада,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ)) КАК ПериодМесяц,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ)) КАК ПериодКвартал,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД)) КАК ПериодГод}
	 |{УПОРЯДОЧИТЬ ПО
	 |	ИсточникДанных.Номенклатура.Изготовитель.*,
	 |	ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец.*,
	 |	Номенклатура.*,
	 |	Склад.*,
	 |	Качество.*,
	 |	СтатусПартии.*,
	 |	СтрокаПрихода.*,
	 |	Организация.*,
	 |	ИсточникДанных.КоличествоПриход,
	 |	ИсточникДанных.СуммаРублиПриход,
	 |	Регистратор.*,
	 |	Период,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}
	 |ИТОГИ
	 |	СУММА(Количество),
	 |	СУММА(Сумма)
	 |ПО
	 |	ОБЩИЕ
	 |{ИТОГИ ПО
	 |	ИсточникДанных.Номенклатура.Изготовитель.* КАК Изготовитель,
	 |	ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец.* КАК Поставщик,
	 |	Номенклатура.*,
	 |	Склад.*,
	 |	Качество.*,
	 |	СтатусПартии.*,
	 |	СтрокаПрихода.*,
	 |	Организация.*,
	 |	Регистратор.*,
	 |	Период,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}
	 |АВТОУПОРЯДОЧИВАНИЕ";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Поставщик", "Поставщик", "Поставщик", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Склад", "Склад", "Склад", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;

КонецПроцедуры

Процедура УстановитьТекстЗапроса_0(ЕстьПолеРегистратор = Истина)

	// Описание исходного текста запроса.
	ТекстЗапроса =
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	Партии.Организация КАК Организация,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Организация),
	 |	Партии.Поставщик КАК Поставщик,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Поставщик) КАК ПоставщикПредставление,
	 |	Партии.Изготовитель КАК Изготовитель,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Изготовитель) КАК ИзготовительПредставление,
	 |	Партии.Склад КАК Склад,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Склад),
	 |	Партии.Номенклатура КАК Номенклатура,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Номенклатура),
	 |	Партии.Регистратор КАК Регистратор,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Регистратор),
	 |	Партии.ПериодДень КАК ПериодДень,
	 |	Партии.ПериодНеделя КАК ПериодНеделя,
	 |	Партии.ПериодДекада КАК ПериодДекада,
	 |	Партии.ПериодМесяц КАК ПериодМесяц,
	 |	Партии.ПериодКвартал КАК ПериодКвартал,
	 |	Партии.ПериодПолугодие КАК ПериодПолугодие,
	 |	Партии.ПериодГод КАК ПериодГод,
	 |	Партии.Количество КАК Количество,
	 |	Партии.Сумма КАК Сумма
	 |{ВЫБРАТЬ
	 |	Организация.* КАК Организация,
	 |	Поставщик.* КАК Поставщик,
	 |	Изготовитель.* КАК Изготовитель,
	 |	Склад.* КАК Склад,
	 |	Номенклатура.* КАК Номенклатура,
	 |	Регистратор.* КАК Регистратор,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод,
	 |	Количество КАК Количество,
	 |	Сумма КАК Сумма}
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ПартииОбороты.Организация КАК Организация,
	 |		ПартииОбороты.Поставщик КАК Поставщик,
	 |		ПартииОбороты.Изготовитель КАК Изготовитель,
	 |		ПартииОбороты.Склад КАК Склад,
	 |		ПартииОбороты.Номенклатура КАК Номенклатура,
	 |		ПартииОбороты.Регистратор КАК Регистратор,
	 |		ПартииОбороты.ПериодДень КАК ПериодДень,
	 |		ПартииОбороты.ПериодНеделя КАК ПериодНеделя,
	 |		ПартииОбороты.ПериодДекада КАК ПериодДекада,
	 |		ПартииОбороты.ПериодМесяц КАК ПериодМесяц,
	 |		ПартииОбороты.ПериодКвартал КАК ПериодКвартал,
	 |		ПартииОбороты.ПериодПолугодие КАК ПериодПолугодие,
	 |		ПартииОбороты.ПериодГод КАК ПериодГод,
	 |		ПартииОбороты.Количество КАК Количество,
	 |		ПартииОбороты.Количество КАК Сумма
	 |	{ВЫБРАТЬ
	 |		Организация.* КАК Организация,
	 |		Поставщик.* КАК Поставщик,
	 |		Изготовитель.* КАК Изготовитель,
	 |		Склад.* КАК Склад,
	 |		Номенклатура.* КАК Номенклатура,
	 |		Регистратор.* КАК Регистратор,
	 |		ПериодДень,
	 |		ПериодНеделя,
	 |		ПериодДекада,
	 |		ПериодМесяц,
	 |		ПериодКвартал,
	 |		ПериодПолугодие,
	 |		ПериодГод,
	 |		Количество,
	 |		Сумма}
	 |	ИЗ
	 |		(ВЫБРАТЬ
	 |			РегПартии1.Организация КАК Организация,
	 |			РегПартии1.СтрокаПрихода.ТорговаяТочка.Владелец КАК Поставщик,
	 |			РегПартии1.Номенклатура.Изготовитель КАК Изготовитель,
	 |			РегПартии1.Склад КАК Склад,
	 |			РегПартии1.Номенклатура КАК Номенклатура,
	 |			РегПартии1.Регистратор КАК Регистратор,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ДЕНЬ) КАК ПериодДень,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ДЕКАДА) КАК ПериодДекада,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, МЕСЯЦ) КАК ПериодМесяц,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, КВАРТАЛ) КАК ПериодКвартал,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ГОД) КАК ПериодГод,
	 |			0 КАК Количество,
	 |			0 КАК Сумма
	 |		{ВЫБРАТЬ
	 |			Организация.* КАК Организация,
	 |			РегПартии1.СтрокаПрихода.ТорговаяТочка.Владелец.* КАК Поставщик,
	 |			РегПартии1.Номенклатура.Изготовитель.* КАК Изготовитель,
	 |			Склад.* КАК Склад,
	 |			Номенклатура.* КАК Номенклатура,
	 |			Регистратор.* КАК Регистратор,
	 |			ПериодДень,
	 |			ПериодНеделя,
	 |			ПериодДекада,
	 |			ПериодМесяц,
	 |			ПериодКвартал,
	 |			ПериодПолугодие,
	 |			ПериодГод,
	 |			РегПартии1.КоличествоПриход,
	 |			РегПартии1.СуммаРублиПриход}
	 |		ИЗ
	 |			РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Организация).*, (СтрокаПрихода.ТорговаяТочка.Владелец).* КАК Поставщик, (Номенклатура.Изготовитель).* КАК Изготовитель, (Склад).*, (Номенклатура).*}) КАК РегПартии1
	 |		
	 |		ОБЪЕДИНИТЬ ВСЕ
	 |		
	 |		ВЫБРАТЬ
	 |			РегПартии2.Организация,
	 |			РегПартии2.СтрокаПрихода.ТорговаяТочка.Владелец,
	 |			РегПартии2.Номенклатура.Изготовитель,
	 |			РегПартии2.Склад,
	 |			РегПартии2.Номенклатура,
	 |			РегПартии2.Регистратор,
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ДЕНЬ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, НЕДЕЛЯ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ДЕКАДА),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, МЕСЯЦ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, КВАРТАЛ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ПОЛУГОДИЕ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ГОД),
	 |			РегПартии2.КоличествоПриход,
	 |			РегПартии2.СуммаРублиПриход
	 |		{ВЫБРАТЬ
	 |			Организация.* КАК Организация,
	 |			(РегПартии2.СтрокаПрихода.ТорговаяТочка.Владелец).* КАК Поставщик,
	 |			(РегПартии2.Номенклатура.Изготовитель).* КАК Изготовитель,
	 |			Склад.* КАК Склад,
	 |			Номенклатура.* КАК Номенклатура,
	 |			Регистратор.* КАК Регистратор,
	 |			ПериодДень,
	 |			ПериодНеделя,
	 |			ПериодДекада,
	 |			ПериодМесяц,
	 |			ПериодКвартал,
	 |			ПериодПолугодие,
	 |			ПериодГод,
	 |			(РегПартии2.КоличествоПриход),
	 |			(РегПартии2.СуммаРублиПриход)}
	 |		ИЗ
	 |			РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Организация).*, (СтрокаПрихода.ТорговаяТочка.Владелец).* КАК Поставщик, (Номенклатура.Изготовитель).* КАК Изготовитель, (Склад).*, (Номенклатура).*}) КАК РегПартии2) КАК ПартииОбороты
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ПартииОбороты.Организация,
	 |		ПартииОбороты.Поставщик,
	 |		ПартииОбороты.Изготовитель,
	 |		ПартииОбороты.Склад,
	 |		ПартииОбороты.Номенклатура,
	 |		ПартииОбороты.Регистратор,
	 |		ПартииОбороты.ПериодДень,
	 |		ПартииОбороты.ПериодНеделя,
	 |		ПартииОбороты.ПериодДекада,
	 |		ПартииОбороты.ПериодМесяц,
	 |		ПартииОбороты.ПериодКвартал,
	 |		ПартииОбороты.ПериодПолугодие,
	 |		ПартииОбороты.ПериодГод,
	 |		ПартииОбороты.Количество,
	 |		ПартииОбороты.Сумма,
	 |		ПартииОбороты.Количество) КАК Партии
	 |{ГДЕ
	 |	Партии.Регистратор.* КАК Регистратор,
	 |	Партии.ПериодДень КАК ПериодДень,
	 |	Партии.ПериодНеделя КАК ПериодНеделя,
	 |	Партии.ПериодДекада КАК ПериодДекада,
	 |	Партии.ПериодМесяц КАК ПериодМесяц,
	 |	Партии.ПериодКвартал КАК ПериодКвартал,
	 |	Партии.ПериодПолугодие КАК ПериодПолугодие,
	 |	Партии.ПериодГод КАК ПериодГод,
	 |	Партии.Количество КАК Количество,
	 |	Партии.Сумма КАК Сумма}
	 |{УПОРЯДОЧИТЬ ПО
	 |	Организация.* КАК Организация,
	 |	Поставщик.* КАК Поставщик,
	 |	Изготовитель.* КАК Изготовитель,
	 |	Склад.* КАК Склад,
	 |	Номенклатура.* КАК Номенклатура,
	 |	Регистратор.* КАК Регистратор,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод,
	 |	Количество,
	 |	Сумма}
	 |ИТОГИ
	 |	СУММА(Количество),
	 |	СУММА(Сумма)
	 |ПО
	 |	ОБЩИЕ
	 |{ИТОГИ ПО
	 |	Организация.* КАК Организация,
	 |	Поставщик.* КАК Поставщик,
	 |	Изготовитель.* КАК Изготовитель,
	 |	Склад.* КАК Склад,
	 |	Номенклатура.* КАК Номенклатура,
	 |	Регистратор.* КАК Регистратор,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Поставщик", "Поставщик", "Поставщик", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Склад", "Склад", "Склад", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;

КонецПроцедуры

Процедура УстановитьТекстЗапроса_1(ЕстьПолеРегистратор = Истина)

	// Описание исходного текста запроса.
	ТекстЗапроса =
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	Партии.Организация КАК Организация,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Организация),
	 |	Партии.Поставщик КАК Поставщик,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Поставщик) КАК ПоставщикПредставление,
	 |	Партии.Изготовитель КАК Изготовитель,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Изготовитель) КАК ИзготовительПредставление,
	 |	Партии.Склад КАК Склад,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Склад),
	 |	Партии.Номенклатура КАК Номенклатура,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Номенклатура),
	 |	Партии.Регистратор КАК Регистратор,
	 |	ПРЕДСТАВЛЕНИЕ(Партии.Регистратор),
	 |	Партии.ПериодДень КАК ПериодДень,
	 |	Партии.ПериодНеделя КАК ПериодНеделя,
	 |	Партии.ПериодДекада КАК ПериодДекада,
	 |	Партии.ПериодМесяц КАК ПериодМесяц,
	 |	Партии.ПериодКвартал КАК ПериодКвартал,
	 |	Партии.ПериодПолугодие КАК ПериодПолугодие,
	 |	Партии.ПериодГод КАК ПериодГод,
	 |	Партии.Количество КАК Количество,
	 |	Партии.Сумма КАК Сумма
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ПартииОбороты.Организация КАК Организация,
	 |		ПартииОбороты.Поставщик КАК Поставщик,
	 |		ПартииОбороты.Изготовитель КАК Изготовитель,
	 |		ПартииОбороты.Склад КАК Склад,
	 |		ПартииОбороты.Номенклатура КАК Номенклатура,
	 |		ПартииОбороты.Регистратор КАК Регистратор,
	 |		ПартииОбороты.ПериодДень КАК ПериодДень,
	 |		ПартииОбороты.ПериодНеделя КАК ПериодНеделя,
	 |		ПартииОбороты.ПериодДекада КАК ПериодДекада,
	 |		ПартииОбороты.ПериодМесяц КАК ПериодМесяц,
	 |		ПартииОбороты.ПериодКвартал КАК ПериодКвартал,
	 |		ПартииОбороты.ПериодПолугодие КАК ПериодПолугодие,
	 |		ПартииОбороты.ПериодГод КАК ПериодГод,
	 |		ПартииОбороты.Количество КАК Количество,
	 |		ПартииОбороты.Количество КАК Сумма
	 |	ИЗ
	 |		(ВЫБРАТЬ
	 |			РегПартии1.Организация КАК Организация,
	 |			РегПартии1.СтрокаПрихода.ТорговаяТочка.Владелец КАК Поставщик,
	 |			РегПартии1.Номенклатура.Изготовитель КАК Изготовитель,
	 |			РегПартии1.Склад КАК Склад,
	 |			РегПартии1.Номенклатура КАК Номенклатура,
	 |			РегПартии1.Регистратор КАК Регистратор,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ДЕНЬ) КАК ПериодДень,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ДЕКАДА) КАК ПериодДекада,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, МЕСЯЦ) КАК ПериодМесяц,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, КВАРТАЛ) КАК ПериодКвартал,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	 |			НАЧАЛОПЕРИОДА(РегПартии1.Период, ГОД) КАК ПериодГод,
	 |			0 КАК Количество,
	 |			0 КАК Сумма
	 |		ИЗ
	 |			РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Организация).*, (СтрокаПрихода.ТорговаяТочка.Владелец).* КАК Поставщик, (Номенклатура.Изготовитель).* КАК Изготовитель, (Склад).*, (Номенклатура).*}) КАК РегПартии1
	 |		
	 |		ОБЪЕДИНИТЬ ВСЕ
	 |		
	 |		ВЫБРАТЬ
	 |			РегПартии2.Организация,
	 |			РегПартии2.СтрокаПрихода.ТорговаяТочка.Владелец,
	 |			РегПартии2.Номенклатура.Изготовитель,
	 |			РегПартии2.Склад,
	 |			РегПартии2.Номенклатура,
	 |			РегПартии2.Регистратор,
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ДЕНЬ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, НЕДЕЛЯ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ДЕКАДА),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, МЕСЯЦ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, КВАРТАЛ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ПОЛУГОДИЕ),
	 |			НАЧАЛОПЕРИОДА(РегПартии2.Период, ГОД),
	 |			РегПартии2.КоличествоПриход,
	 |			РегПартии2.СуммаРублиПриход
	 |		ИЗ
	 |			РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Организация).*, (СтрокаПрихода.ТорговаяТочка.Владелец).* КАК Поставщик, (Номенклатура.Изготовитель).* КАК Изготовитель, (Склад).*, (Номенклатура).*}) КАК РегПартии2) КАК ПартииОбороты
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ПартииОбороты.Организация,
	 |		ПартииОбороты.Поставщик,
	 |		ПартииОбороты.Изготовитель,
	 |		ПартииОбороты.Склад,
	 |		ПартииОбороты.Номенклатура,
	 |		ПартииОбороты.Регистратор,
	 |		ПартииОбороты.ПериодДень,
	 |		ПартииОбороты.ПериодНеделя,
	 |		ПартииОбороты.ПериодДекада,
	 |		ПартииОбороты.ПериодМесяц,
	 |		ПартииОбороты.ПериодКвартал,
	 |		ПартииОбороты.ПериодПолугодие,
	 |		ПартииОбороты.ПериодГод,
	 |		ПартииОбороты.Количество,
	 |		ПартииОбороты.Сумма,
	 |		ПартииОбороты.Количество) КАК Партии
	 |{ГДЕ
	 |	Партии.Регистратор.* КАК Регистратор,
	 |	Партии.ПериодДень КАК ПериодДень,
	 |	Партии.ПериодНеделя КАК ПериодНеделя,
	 |	Партии.ПериодДекада КАК ПериодДекада,
	 |	Партии.ПериодМесяц КАК ПериодМесяц,
	 |	Партии.ПериодКвартал КАК ПериодКвартал,
	 |	Партии.ПериодПолугодие КАК ПериодПолугодие,
	 |	Партии.ПериодГод КАК ПериодГод,
	 |	Партии.Количество КАК Количество,
	 |	Партии.Сумма КАК Сумма}
	 |{УПОРЯДОЧИТЬ ПО
	 |	Организация.* КАК Организация,
	 |	Поставщик.* КАК Поставщик,
	 |	Изготовитель.* КАК Изготовитель,
	 |	Склад.* КАК Склад,
	 |	Номенклатура.* КАК Номенклатура,
	 |	Регистратор.* КАК Регистратор,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод,
	 |	Количество,
	 |	Сумма}
	 |ИТОГИ
	 |	СУММА(Количество),
	 |	СУММА(Сумма)
	 |ПО
	 |	ОБЩИЕ
	 |{ИТОГИ ПО
	 |	Организация.* КАК Организация,
	 |	Поставщик.* КАК Поставщик,
	 |	Изготовитель.* КАК Изготовитель,
	 |	Склад.* КАК Склад,
	 |	Номенклатура.* КАК Номенклатура,
	 |	Регистратор.* КАК Регистратор,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Поставщик", "Поставщик", "Поставщик", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Склад", "Склад", "Склад", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;

КонецПроцедуры

Процедура УстановитьТекстЗапроса_2(ЕстьПолеРегистратор = Истина)

	// Описание исходного текста запроса.
	ТекстЗапроса =
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ИсточникДанных.Номенклатура.Изготовитель КАК Изготовитель,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Номенклатура.Изготовитель) КАК ИзготовительПредставление,
	 |	ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец КАК Поставщик,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтрокаПрихода.ТорговаяТочка.Владелец) КАК ПоставщикПредставление,
	 |	ИсточникДанных.Номенклатура КАК Номенклатура,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Номенклатура) КАК НоменклатураПредставление,
	 |	ИсточникДанных.Склад КАК Склад,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Склад) КАК СкладПредставление,
	 |	ИсточникДанных.Качество КАК Качество,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Качество) КАК КачествоПредставление,
	 |	ИсточникДанных.СтатусПартии КАК СтатусПартии,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтатусПартии) КАК СтатусПартииПредставление,
	 |	ИсточникДанных.СтрокаПрихода КАК СтрокаПрихода,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтрокаПрихода) КАК СтрокаПриходаПредставление,
	 |	ИсточникДанных.Организация КАК Организация,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Организация) КАК ОрганизацияПредставление,
	 |	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	 |	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	 |	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
	 |	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	 |	ИсточникДанных.КоличествоОборот КАК КоличествоОборот,
	 |	ИсточникДанных.СуммаРублиНачальныйОстаток КАК СуммаРублиНачальныйОстаток,
	 |	ИсточникДанных.СуммаРублиПриход КАК СуммаРублиПриход,
	 |	ИсточникДанных.СуммаРублиРасход КАК СуммаРублиРасход,
	 |	ИсточникДанных.СуммаРублиКонечныйОстаток КАК СуммаРублиКонечныйОстаток,
	 |	ИсточникДанных.СуммаРублиОборот КАК СуммаРублиОборот,
	 |	ИсточникДанных.СуммаДолларыНачальныйОстаток КАК СуммаДолларыНачальныйОстаток,
	 |	ИсточникДанных.СуммаДолларыПриход КАК СуммаДолларыПриход,
	 |	ИсточникДанных.СуммаДолларыРасход КАК СуммаДолларыРасход,
	 |	ИсточникДанных.СуммаДолларыКонечныйОстаток КАК СуммаДолларыКонечныйОстаток,
	 |	ИсточникДанных.СуммаДолларыОборот КАК СуммаДолларыОборот,
	 |	ИсточникДанных.СуммаЕвроНачальныйОстаток КАК СуммаЕвроНачальныйОстаток,
	 |	ИсточникДанных.СуммаЕвроПриход КАК СуммаЕвроПриход,
	 |	ИсточникДанных.СуммаЕвроРасход КАК СуммаЕвроРасход,
	 |	ИсточникДанных.СуммаЕвроКонечныйОстаток КАК СуммаЕвроКонечныйОстаток,
	 |	ИсточникДанных.СуммаЕвроОборот КАК СуммаЕвроОборот,
	 |	ИсточникДанных.СуммаБезНДСНачальныйОстаток КАК СуммаБезНДСНачальныйОстаток,
	 |	ИсточникДанных.СуммаБезНДСПриход КАК СуммаБезНДСПриход,
	 |	ИсточникДанных.СуммаБезНДСРасход КАК СуммаБезНДСРасход,
	 |	ИсточникДанных.СуммаБезНДСКонечныйОстаток КАК СуммаБезНДСКонечныйОстаток,
	 |	ИсточникДанных.СуммаБезНДСОборот КАК СуммаБезНДСОборот,
	 |	ИсточникДанных.Регистратор КАК Регистратор,
	 |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Регистратор) КАК РегистраторПредставление,
	 |	ИсточникДанных.Период КАК Период,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ) КАК ПериодДень,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА) КАК ПериодДекада,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ) КАК ПериодМесяц,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ) КАК ПериодКвартал,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	 |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД) КАК ПериодГод
	 |{ВЫБРАТЬ
	 |	Номенклатура.*,
	 |	Склад.*,
	 |	Качество.*,
	 |	СтатусПартии.*,
	 |	СтрокаПрихода.*,
	 |	Организация.*,
	 |	КоличествоНачальныйОстаток,
	 |	КоличествоПриход,
	 |	КоличествоРасход,
	 |	КоличествоКонечныйОстаток,
	 |	КоличествоОборот,
	 |	СуммаРублиНачальныйОстаток,
	 |	СуммаРублиПриход,
	 |	СуммаРублиРасход,
	 |	СуммаРублиКонечныйОстаток,
	 |	СуммаРублиОборот,
	 |	СуммаДолларыНачальныйОстаток,
	 |	СуммаДолларыПриход,
	 |	СуммаДолларыРасход,
	 |	СуммаДолларыКонечныйОстаток,
	 |	СуммаДолларыОборот,
	 |	СуммаЕвроНачальныйОстаток,
	 |	СуммаЕвроПриход,
	 |	СуммаЕвроРасход,
	 |	СуммаЕвроКонечныйОстаток,
	 |	СуммаЕвроОборот,
	 |	СуммаБезНДСНачальныйОстаток,
	 |	СуммаБезНДСПриход,
	 |	СуммаБезНДСРасход,
	 |	СуммаБезНДСКонечныйОстаток,
	 |	СуммаБезНДСОборот,
	 |	Регистратор.* КАК Регистратор,
	 |	Период КАК Период,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}
	 |ИЗ
	 |	РегистрНакопления.ПартииТоваров.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(Номенклатура).* КАК Номенклатура, (Склад).* КАК Склад, (Качество).* КАК Качество, (СтатусПартии).* КАК СтатусПартии, (СтрокаПрихода).* КАК СтрокаПрихода, (Организация).* КАК Организация}) КАК ИсточникДанных
	 |{ГДЕ
	 |	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	 |	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	 |	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
	 |	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	 |	ИсточникДанных.КоличествоОборот КАК КоличествоОборот,
	 |	ИсточникДанных.СуммаРублиНачальныйОстаток КАК СуммаРублиНачальныйОстаток,
	 |	ИсточникДанных.СуммаРублиПриход КАК СуммаРублиПриход,
	 |	ИсточникДанных.СуммаРублиРасход КАК СуммаРублиРасход,
	 |	ИсточникДанных.СуммаРублиКонечныйОстаток КАК СуммаРублиКонечныйОстаток,
	 |	ИсточникДанных.СуммаРублиОборот КАК СуммаРублиОборот,
	 |	ИсточникДанных.СуммаДолларыНачальныйОстаток КАК СуммаДолларыНачальныйОстаток,
	 |	ИсточникДанных.СуммаДолларыПриход КАК СуммаДолларыПриход,
	 |	ИсточникДанных.СуммаДолларыРасход КАК СуммаДолларыРасход,
	 |	ИсточникДанных.СуммаДолларыКонечныйОстаток КАК СуммаДолларыКонечныйОстаток,
	 |	ИсточникДанных.СуммаДолларыОборот КАК СуммаДолларыОборот,
	 |	ИсточникДанных.СуммаЕвроНачальныйОстаток КАК СуммаЕвроНачальныйОстаток,
	 |	ИсточникДанных.СуммаЕвроПриход КАК СуммаЕвроПриход,
	 |	ИсточникДанных.СуммаЕвроРасход КАК СуммаЕвроРасход,
	 |	ИсточникДанных.СуммаЕвроКонечныйОстаток КАК СуммаЕвроКонечныйОстаток,
	 |	ИсточникДанных.СуммаЕвроОборот КАК СуммаЕвроОборот,
	 |	ИсточникДанных.СуммаБезНДСНачальныйОстаток КАК СуммаБезНДСНачальныйОстаток,
	 |	ИсточникДанных.СуммаБезНДСПриход КАК СуммаБезНДСПриход,
	 |	ИсточникДанных.СуммаБезНДСРасход КАК СуммаБезНДСРасход,
	 |	ИсточникДанных.СуммаБезНДСКонечныйОстаток КАК СуммаБезНДСКонечныйОстаток,
	 |	ИсточникДанных.СуммаБезНДСОборот КАК СуммаБезНДСОборот,
	 |	ИсточникДанных.Регистратор.* КАК Регистратор,
	 |	ИсточникДанных.Период КАК Период,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ)) КАК ПериодДень,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА)) КАК ПериодДекада,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ)) КАК ПериодМесяц,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ)) КАК ПериодКвартал,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	 |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД)) КАК ПериодГод}
	 |{УПОРЯДОЧИТЬ ПО
	 |	Номенклатура.*,
	 |	Склад.*,
	 |	Качество.*,
	 |	СтатусПартии.*,
	 |	СтрокаПрихода.*,
	 |	Организация.*,
	 |	КоличествоНачальныйОстаток,
	 |	КоличествоПриход,
	 |	КоличествоРасход,
	 |	КоличествоКонечныйОстаток,
	 |	КоличествоОборот,
	 |	СуммаРублиНачальныйОстаток,
	 |	СуммаРублиПриход,
	 |	СуммаРублиРасход,
	 |	СуммаРублиКонечныйОстаток,
	 |	СуммаРублиОборот,
	 |	СуммаДолларыНачальныйОстаток,
	 |	СуммаДолларыПриход,
	 |	СуммаДолларыРасход,
	 |	СуммаДолларыКонечныйОстаток,
	 |	СуммаДолларыОборот,
	 |	СуммаЕвроНачальныйОстаток,
	 |	СуммаЕвроПриход,
	 |	СуммаЕвроРасход,
	 |	СуммаЕвроКонечныйОстаток,
	 |	СуммаЕвроОборот,
	 |	СуммаБезНДСНачальныйОстаток,
	 |	СуммаБезНДСПриход,
	 |	СуммаБезНДСРасход,
	 |	СуммаБезНДСКонечныйОстаток,
	 |	СуммаБезНДСОборот,
	 |	Регистратор.*,
	 |	Период,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}
	 |ИТОГИ
	 |	СУММА(КоличествоНачальныйОстаток),
	 |	СУММА(КоличествоПриход),
	 |	СУММА(КоличествоРасход),
	 |	СУММА(КоличествоКонечныйОстаток),
	 |	СУММА(КоличествоОборот),
	 |	СУММА(СуммаРублиНачальныйОстаток),
	 |	СУММА(СуммаРублиПриход),
	 |	СУММА(СуммаРублиРасход),
	 |	СУММА(СуммаРублиКонечныйОстаток),
	 |	СУММА(СуммаРублиОборот),
	 |	СУММА(СуммаДолларыНачальныйОстаток),
	 |	СУММА(СуммаДолларыПриход),
	 |	СУММА(СуммаДолларыРасход),
	 |	СУММА(СуммаДолларыКонечныйОстаток),
	 |	СУММА(СуммаДолларыОборот),
	 |	СУММА(СуммаЕвроНачальныйОстаток),
	 |	СУММА(СуммаЕвроПриход),
	 |	СУММА(СуммаЕвроРасход),
	 |	СУММА(СуммаЕвроКонечныйОстаток),
	 |	СУММА(СуммаЕвроОборот),
	 |	СУММА(СуммаБезНДСНачальныйОстаток),
	 |	СУММА(СуммаБезНДСПриход),
	 |	СУММА(СуммаБезНДСРасход),
	 |	СУММА(СуммаБезНДСКонечныйОстаток),
	 |	СУММА(СуммаБезНДСОборот)
	 |ПО
	 |	ОБЩИЕ
	 |{ИТОГИ ПО
	 |	Номенклатура.*,
	 |	Склад.*,
	 |	Качество.*,
	 |	СтатусПартии.*,
	 |	СтрокаПрихода.*,
	 |	Организация.*,
	 |	Регистратор.*,
	 |	Период,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод}
	 |АВТОУПОРЯДОЧИВАНИЕ";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Поставщик", "Поставщик", "Поставщик", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Склад", "Склад", "Склад", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Партии.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;

КонецПроцедуры

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	УстановитьТекстЗапроса();
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Изготовитель", "Изготовитель");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Поставщик", "Поставщик");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", "Номенклатура");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сумма", "Сумма");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Количество", Истина, "ЧЦ=15; ЧДЦ=0", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("Сумма", "Сумма", Истина, "ЧЦ=15; ЧДЦ=2", "Сумма", "Сумма");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Изготовитель");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Поставщик");
	
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Изготовитель");
	УниверсальныйОтчет.ДобавитьОтбор("Поставщик");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	УниверсальныйОтчет.УстановитьСвязьПолей("Изготовитель", "Номенклатура");
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формированием отчета можно установить необходимые параметры универсального отчета
	
	ЕстьПолеРегистратор = Ложь;
	Для каждого ВыбранноеПоле Из УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля Цикл
	
		ЕстьПолеРегистратор = Найти(ВыбранноеПоле.ПутьКДанным, "Регистратор") > 0;
		Если ЕстьПолеРегистратор Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	НастройкиПостроителя = УниверсальныйОтчет.ПостроительОтчета.ПолучитьНастройки(); 
	УстановитьТекстЗапроса(ЕстьПолеРегистратор);
	УниверсальныйОтчет.ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя); 
	
	Если ЕстьПолеРегистратор Тогда
		
		НетГруппировкиПоИзготовителю = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("Изготовитель") = Неопределено;
		Если НетГруппировкиПоИзготовителю Тогда
		
			НужноеИзмерение = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("Поставщик");
			Если НужноеИзмерение = Неопределено Тогда
				НужноеИзмерение = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("Организация");
			КонецЕсли;
			
			Если НужноеИзмерение = Неопределено Тогда
				ИндексИзготовителя = 0;
			Иначе
				ИндексИзготовителя = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Индекс(НужноеИзмерение) + 1;
			КонецЕсли;
				
			УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Вставить("Изготовитель", , , , , ИндексИзготовителя);
		
		КонецЕсли;
	
	КонецЕсли;
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);

КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
